---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthIn
source: html/5cb6f01e-3e59-dfa7-03ca-82337a357062.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthIn Property

"Main Primary Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartDepthIn { get; }
```